import cv2 as cv

img = cv.imread('image/pic_0005.jpg')
print(f'访问像素值：{img[100, 100]}')
print(f'访问蓝色通道值：{img[100, 100, 0]}')  # BGR
print('---------------------------------------')

# 修改像素值
img[100, 100] = [255, 255, 255]
print(f'访问像素值：{img[100, 100]}')
print(f'访问蓝色通道值：{img[100, 100, 0]}')  # BGR
print('---------------------------------------')

"""
前面的方法通常用于选择数组的区域，切片
如果访问单个像素，使用item()和itemset()更快,但是始终返回标量
如果要访问所有的BGR，要分别调用item
"""
print(f'访问单个像素：{img.item(100, 100, 0)}')
img.itemset((100, 100, 0), 128)
print(f'访问单个像素：{img.item(100, 100, 0)}')
